In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.preprocessing import StandardScaler, Normalizer
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [256]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [257]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [258]:
df = df.drop(['Name', 'Ticket', 'Cabin'], axis=1)

In [259]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [260]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [261]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [262]:
df.shape

(891, 9)

In [263]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [264]:
df = df.fillna(df.mean())

/var/folders/5c/pzj0y5h148744pgqxkdpwzsh0000gn/T/ipykernel_13285/114435927.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df = df.fillna(df.mean())

In [265]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [266]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [267]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [268]:
df = df.drop(['Embarked'], axis=1)

In [269]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

In [270]:
encoder = LabelEncoder()
df['Sex'] = encoder.fit_transform(df['Sex'])

In [271]:
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    1  22.0      1      0   7.2500
1            2         1       1    0  38.0      1      0  71.2833
2            3         1       3    0  26.0      0      0   7.9250
3            4         1       1    0  35.0      1      0  53.1000
4            5         0       3    1  35.0      0      0   8.0500

In [272]:
y = df.iloc[:, 1].values

In [273]:
df = df.drop(['Survived'], axis=1)

In [274]:
df.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0            1       3    1  22.0      1      0   7.2500
1            2       1    0  38.0      1      0  71.2833
2            3       3    0  26.0      0      0   7.9250
3            4       1    0  35.0      1      0  53.1000
4            5       3    1  35.0      0      0   8.0500

In [275]:
X = df.iloc[:, :].values

In [276]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=0)

In [277]:
no = StandardScaler()
X_train = no.fit_transform(X_train)
X_test = no.transform(X_test)

In [278]:
X_train

array([[ 1.59014094, -1.5325562 ,  0.72592065, ..., -0.457246  ,
        -0.47299765, -0.12253019],
       [-1.52952238, -1.5325562 , -1.37756104, ...,  0.4033711 ,
        -0.47299765,  0.91812372],
       [-0.23515275,  0.84844757,  0.72592065, ...,  3.8458395 ,
         1.93253327,  0.29950338],
       ...,
       [ 0.70655928,  0.84844757,  0.72592065, ..., -0.457246  ,
        -0.47299765, -0.51276504],
       [ 0.43528421,  0.84844757, -1.37756104, ...,  0.4033711 ,
        -0.47299765, -0.31228976],
       [ 0.91970398, -0.34205431,  0.72592065, ...,  0.4033711 ,
         0.72976781,  0.13566725]])

In [279]:
def knearest(Xtrain, Xtest, ytrain, ytest):
    classifier = KNeighborsClassifier(metric='minkowski', n_neighbors=8)
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The K nearest neighbor gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [280]:
knearest(Xtrain=X_train, Xtest=X_test, ytrain=y_train, ytest=y_test)

'The K nearest neighbor gives the accuracy score of 82.46 and the confusion matrix is \n [[153  15]\n [ 32  68]]'

In [281]:
def gaussian(Xtrain, Xtest, ytrain, ytest):
    classifier = GaussianNB()
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The Gaussian NB algorithm gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [282]:
gaussian(X_train, X_test, y_train, y_test)

'The Gaussian NB algorithm gives the accuracy score of 78.36 and the confusion matrix is \n [[138  30]\n [ 28  72]]'

In [283]:
def logistic(Xtrain, Xtest, ytrain, ytest):
    classifier = LogisticRegression()
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The Logistic regression algorithm gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [284]:
logistic(X_train, X_test, y_train, y_test)

'The Logistic regression algorithm gives the accuracy score of 80.6 and the confusion matrix is \n [[143  25]\n [ 27  73]]'

In [285]:
def random_forest(Xtrain, Xtest, ytrain, ytest):
    classifier = RandomForestClassifier(criterion='entropy', n_estimators=100)
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The random forest algorithm gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [286]:
random_forest(X_train, X_test, y_train, y_test)

'The random forest algorithm gives the accuracy score of 82.46 and the confusion matrix is \n [[148  20]\n [ 27  73]]'

In [287]:
def tree(Xtrain, Xtest, ytrain, ytest):
    classifier = DecisionTreeClassifier(criterion='entropy', random_state=0)
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The Decision tree algorithm gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [288]:
tree(X_train, X_test, y_train, y_test)

'The Decision tree algorithm gives the accuracy score of 74.63 and the confusion matrix is \n [[135  33]\n [ 35  65]]'

In [290]:
def svc(Xtrain, Xtest, ytrain, ytest):
    classifier = SVC(kernel='rbf', random_state=0)
    classifier.fit(Xtrain, ytrain);
    
    y_pred = classifier.predict(Xtest)

    score = accuracy_score(ytest, y_pred)  * 100
    matrix = confusion_matrix(ytest, y_pred) 

    return f"The SVC algorithm gives the accuracy score of {round(score, 2)} and the confusion matrix is \n {matrix}"

In [291]:
svc(X_train, X_test, y_train, y_test)

'The SVC algorithm gives the accuracy score of 81.34 and the confusion matrix is \n [[146  22]\n [ 28  72]]'